tutorials/lagrangian/steadyReactingParcelFoam/counterFlowFlame2D/constant/reactingCloud1Properties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      reactingCloud1Properties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solution
{
    active          no;

    integrationSchemes
    {
        U               Euler;
        T               Analytical;
    }
}


constantProperties
{
    parcelTypeId    1;

    rhoMin          1e-15;
    minParticleMass 1e-15;
    TMin            200;
    pMin            1000;
    minParticleMass 1e-15;

    rho0            1400;
    T0              313;
    Cp0             1680;

    youngsModulus   2e9;
    poissonsRatio   0.35;

    epsilon0        0.8;
    f0              0.3;

    Tvap            400;
    Tbp             400;
    Pr              0.7;
    LDevol          0;
    hRetentionCoeff 1;

    constantVolume  true;
}


particleForces
{
    gravity         off;
    virtualMass     off;
    pressureGradient off;
    paramagnetic    off;
}


subModels
{
    InjectionModel  none;

    CollisionModel  none;

    DragModel       none;

    DispersionModel none;

    PatchInteractionModel none;

    HeatTransferModel none;

    CompositionModel none;

    PhaseChangeModel none;

    DevolatilisationModel none;

    SurfaceReactionModel none;

    PostProcessingModel none;

    SurfaceFilmModel none;

    radiation       off;
}


// ************************************************************************* //
